<?php

return [
    'identifier_required' => 'البريد الإلكتروني أو رقم الهاتف مطلوب',
    'password_invalid' => 'الرجاء إدخال كلمة مرور صالحة',
    'currency_code' => 'رمز العملة المحدد غير صالح',

    'custom' => [
        'email' => [
            'required' => 'البريد الإلكتروني مطلوب.',
            'email' => 'يرجى إدخال بريد إلكتروني صالح.',
            'unique' => 'هذا البريد الإلكتروني مسجل بالفعل. يرجى استخدام بريد إلكتروني آخر أو تسجيل الدخول.',
        ],
        'name' => [
            'required' => 'الاسم مطلوب.',
        ],
        'organization_name' => [
            'required' => 'اسم المؤسسة مطلوب.',
        ],
        'password' => [
            'required' => 'كلمة المرور مطلوبة.',
            'confirmed' => 'تأكيد كلمة المرور غير مطابق.',
        ],
    ],

];
